sample/aachenBomb/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
source1
{
    type            scalarFixedValueConstraint;
    fieldValues
    {
        Z           0.06;
    }

    timeStart       0;
    duration        0.0001;
    selectionMode   points;
    points
    (
        (0 0.09 0)
    );

    mode            uniform;
}
 
energySource1
{
    type            scalarSemiImplicitSource;

    timeStart       0.01;
    duration        0.09;
    selectionMode   points;
    points
    (
        (0 0.015 0.0005)
        (0.005 0.015 0.0005)
        (-0.005 0.015 0.0005)
    );

    volumeMode      specific;
    injectionRateSuSp
    {
        h           (1000 0);
    }
}
*/
// ************************************************************************* //
